[
    {
        "title": "Don Pushes for More University Funding",
        "description": "By Esosa Omorogbe The newly appointed Vice-Chancellor of Ambrose Alli University Ekpoma, Prof. Eunice Omonzejie, has called on the Nigerian government, multinational agencies, and other stakeholders t...",
        "url": "https://aauekpoma.edu.ng/don-pushes-for-more-university-funding/"
    },
    {
        "title": "AAU Ekpoma’s New Vice-Chancellor Assumes Duty",
        "description": "By Esosa Omorogbe Professor Eunice Omonzejie has officially taken over as the substantive Vice-Chancellor of Ambrose Alli University Ekpoma in a ceremony attended by principal officers, management, st...",
        "url": "https://aauekpoma.edu.ng/aau-ekpomas-new-vice-chancellor-assumes-duty/"
    },
    {
        "title": "BREAKING NEWS: AAU Ekpoma Gets New Vice Chancellor",
        "description": "By Nosa Ekhator Edo State Governor, Senator Monday Okpebholo, has appointed Professor Eunice Eboserehimen Omonzejie as the Vice Chancellor of Ambrose Alli University (AAU), Ekpoma, effective immediate...",
        "url": "https://aauekpoma.edu.ng/aau-ekpoma-gets-new-vice-chancellor/"
    },
    {
        "title": "BREAKING NEWS: AAU Ekpoma Appoints New Registrar",
        "description": "By Esosa Omorogbe Mrs. Oluwayomi Omolegho Agbebaku has been appointed as the substantive Registrar of Ambrose Alli University Ekpoma, according to a letter signed by the Acting Vice-Chancellor Prof. S...",
        "url": "https://aauekpoma.edu.ng/breaking-news-aau-ekpoma-appoints-new-registrar/"
    },
    {
        "title": "AAU,Ekpoma Embarks on Security Enhancement Projects… We Are Making Progress, Says Otunba Aladenika",
        "description": "By Nosa Ekhator Ambrose Alli University, Ekpoma, has commenced construction work on a multipurpose car parking lot for students, marking a significant step in implementing the Governing Council&#8217;...",
        "url": "https://aauekpoma.edu.ng/aauekpoma-embarks-on-security-enhancement-projects-we-are-making-progress-says-otunba-aladenika/"
    },
    {
        "title": "ADJUSTED SECOND SEMESTER ACADEMIC CALENDAR FOR SECOND SEMESTER, 2024/2025 ACADEMIC SESSION",
        "description": "The Acting Vice-Chancellor, Prof. Sunday Olowo Samuel has, on behalf of the Senate of Ambrose Alli University, Ekpoma, approved the adjusted Academic Calander for Second Semester, 2024/2025 Academic S...",
        "url": "https://aauekpoma.edu.ng/adjusted-second-semester-academic-calendar/"
    },
    {
        "title": "AAU To Enjoy Uninterrupted Power Supply, As Okpebholo Approves 1.5 Megawatts Of Alternative Energy For Institution",
        "description": "Francis Onoiribholo Vice Chancellor of the Ambrose Alli University, Ekpoma, Edo State, Professor Sunday Olowo Samuel, has declared that the institution would soon enjoy uninterrupted power supply, say...",
        "url": "https://aauekpoma.edu.ng/aau-to-enjoy-uninterrupted-power-supply-as-okpebholo-approves-1-5-megawatts-of-alternative-energy-for-institution/"
    },
    {
        "title": "‘Okpebholo’s N500m monthly subvention revives AAU, clears salary backlogs’",
        "description": "Management of State-owned Ambrose Alli University (AAU), Ekpoma, says Edo State Governor Monday Okpebholo’s approved N500 million monthly subvention has revived the institution, ending years of financ...",
        "url": "https://aauekpoma.edu.ng/okpebholos-n500m-monthly-subvention-revives-aau-clears-salary-backlogs/"
    },
    {
        "title": "I Will Re-position AAU To World Class University -Prof. Olowo Samuel",
        "description": "BY: dailyfrontlinenews The Acting Vice Chancellor (AVC), Ambrose Alli University, Ekpoma, Prof. Olowo Samuel has vowed to reposition the institution to world Class University. He made the declaration ...",
        "url": "https://aauekpoma.edu.ng/i-will-re-position-aau-to-world-class-university-prof-olowo-samuel/"
    },
    {
        "title": "Police withdrawal from Atiku’s security detail an assassination plot – Timi Frank",
        "description": "The Former Deputy National Publicity Secretary of the All Progressives Congress (APC), Timi Frank, has accused authorities of endangering former Vice President Atiku Abubakar to potential security thr...",
        "url": "https://guardian.ng/news/police-withdrawal-from-atikus-security-detail-an-assassination-plot-timi-frank/"
    }
]